import React, { Component, Fragment } from "react";
import AnnouncementsList from "../announcements/AnnouncementsList.js";
import { connect } from "react-redux";
import { Button, UncontrolledPopover, PopoverHeader, PopoverBody } from 'reactstrap';
import Faq from "react-faq-component";
import { Link } from "react-router-dom";


const styles = {
    // bgColor: 'white',
    rowTitleColor: "#1c6d8b",
    rowContentTextSize: '22px',
    // rowTitleTextAlign: "right",
    // rowContentTextAlign: "right",
    // rowContentColor: 'grey',
    // arrowColor: "red",
};
 
const config = {
     animate: true,
    // arrowIcon: "V",
};


const data = {
    rows: [
        {
            title: "هل الضعيف باللغة الإنجليزية سيستحيل عليه الحصول على درجات عالية؟",
            content: `بالنسبة للفصل الأول فهو يعتمد بشكل كبير على قوتك في اللغة الإنجليزية، لكن هذا لا يعني أنك لن تستطيع الحصول على أعلى الدرجات فيه فلديك فرصة أن تطور نفسك في اللغة ثم ترفع معدلك في الفصل الثاني والذي يتضمن مواد علمية أيضاً`,
        },
        {
            title: "ما هو مقدار المكافأة المستحقة للطالب؟",
            content:
              "يستحق الطالب مكافأة أساسية وقدرها ٩٩٠ ريال",
        },
        {
          title: "متى تودع المكافأة في حساب الطالب؟",
          content:
              "يتم إيداع المكافأة الشهرية في حساب الطالب في اليوم ٢٧ من كل شهر ميلادي",
      },
      {
        title: "متى سيتم إيداع أول مكافأة؟",
        content:
            "يُتوقع أن تُودع أول مكافأة بعد مرور شهرين من بداية العام الدراسي، وستكون بمقدار مكافأتين شهريتين",
    },
    {
      title: "ماهو البنك الذي تصدر منه البطاقة و هل يذهب الطالب للبنك لاستلام بطاقة المكافأة؟",
      content:
          "البنك العربي الوطني. لا، يتم تسليم البطاقة للطالب من قِبل الجامعة، ولاحقاً سيحدد موعد إستلام البطاقة، غالباً سيكون في أول أسبوعين من السنة الدراسية",
  },
  {
    title: "ماهي الخدمات المتاحة في بطاقة المكافأة؟ وهل هناك رسوم إضافية في حال تم سحب مبالغ من خارج آلات صرف البنك العربي؟",
    content:
        "السحب فقط ؛ حيث أن البطاقة غير مخولة لاستلام حوالات بنكية، أو إيداع، ولا يمكن تحويل مبالغ مالية منها أيضاً, و حق للطالب القيام بأربع عمليات سحب من خارج آلات صرف البنك العربي شهرياً ، وفي حال القيام بعملية إضافية؛ ستتم إضافة رسوم عليها من قبل البنك العربي",
},
{
  title: "كيف أطور من لغتي؟",
  content:
      "<div className='row'> \
      <span className='d-block'>:أ- اذا كان مستوى الطالب ضعيف جداً في اللغة الإنجليزية فلابد أن يطور من مهاراته قبل أن يدخل الجامعة إما بدورات أو دروس مكثفة مثل</span> \
      </div> \
      <div className='row'> \
      أكاديمية الفيصل العالمية- \
      </div> \
      <div className='row'> \
      <a rel='noopener noreferrer' target='_blank' href='http://www.alfac.edu.sa/الرجال'>http://www.alfac.edu.sa/الرجال</a>  \
      </div> \
      <div className='row'> \
      ب- إذا كان مستوى الطالب متوسط في اللغة فيجب عليه أن يبذل جهده في المذاكرة ولا يقصر فيها  \
      وخلال دراستك بالجامعة تستطيع أن تتدرب على بعض المهارات باستخدام بعض المواقع مثل: \
      </div> \
      <div className='row'> \
       Readworks ( للقراءة وتعلم مفردات اللغة ) • \
       </div> \
       <div className='row'> \
      <a rel='noopener noreferrer' href='https://www.readworks.org'>https://www.readworks.org</a> \
       </div> \
       <div className='row'> \
      esl-lab(للتدريب على الإستماع) • \
      </div> \
      <div className='row'> \
       <a rel='noopener noreferrer' href='/https://www.esl-lab.com'>https://www.esl-lab.com</a> \
      </div> ",
},
{
  title: "كيف جامعة الحرس فيها سنتين تحضيرية؟ وكيف تكون المنافسة على التخصصات؟",
  content:
      "توجد سنة تحضيرية واحده، يتحدد فيها تخصص الطالب... اما بالنسبة للسنة التحضيرية الثانية فهي تحسب من ضمن سنوات التخصص، و الهدف من تسميتها 'السنة التحضيرية الثانية' هو تنظيمي بحيث أنه فيه بعض المواد تدرس لطب الاسنان وللطب البشري، فبدلًا من تدريس هذه المواد (المواد المشتركة) في كليات مختلفة، جمعوها في كلية واحده وهي كلية العلوم والمهن الصحية ",
},
{
  title: "هل تعطي الجامعة تأمين طبي؟ وماذا يشمل وكيف أقدر استفيد منه خصوصًا إذا أبي أصلح أسناني؟",
  content:
  "<div className='row'> \
  <span className='d-block'>نعم تعطي تأمين</span> \
  </div> \
  <div className='row'> \
  (تستطيع استخدامه بكل شيء إلا التجميل وهذا يشمل تجميل الأسنان ( يشمل علاج الأسنان إذا كانت غير تجميلية \
  </div> \
  <div className='row'> \
  لعلاج الأسنان تستطيع الذهاب لكلية الأسنان وتقوم بفتح ملف هناك، تسجل برقم السجل المدني فقط ويعطونك بطاقة خاصه بك، والتسجيل لعامة الناس وليس خاص بمنسوبي الجامعة \
  </div> ",
  
},
{
  title: "هل يوجد نادي رياضي بالجامعة؟ ماذا  توجد فيه من أجهزة وصالات ومتى مسموح لي التسجيل والتمرن فيه؟",
  content:
  "<div className='row'> \
  <span className='d-block'>نعم يوجد نادي رياضي بالجامعة</span> \
  </div> \
  <div className='row'> \
  :النادي الرياضي يحتوي على  \
  </div> \
  <div className='row'> \
  صالة لياقة-  \
  </div> \
  <div className='row'> \
  صالة العاب-  \
  </div> \
  <div className='row'> \
  صالة اثقال-  \
  </div> \
  <div className='row'> \
  صالات التنس وكرة السلة والطائرة-  \
  </div> \
  <div className='row'> \
  ملاعب كرة القدم-  \
  </div> \
  <div className='row'> \
  مسبح وجاكوزي وساونا-  \
  </div> \
  <div className='row'> \
  صالة بيلياردو وتنس طاولة وفريرة-  \
  </div> \
  <div className='row'> \
  وهذا مقطع للنادي الرياضي بالجامعة شامل جميل الصالات والأجهزة   \
  </div> \
   <div className='row'> \
  <a rel='noopener noreferrer' href='https://twitter.com/arshidnyksauhs/status/1168812243494023169?s=12'>https://twitter.com/arshidnyksauhs/status/1168812243494023169?s=12</a> \
   </div> \
   <div className='row'> \
   ومسموح لك تسجل وتتمرن فيها مع بدايتك بسنتك الدراسية، تحديداً بعدما تستلم بادج الجامعة  \
  </div> \
  <div className='row'> \
  :أوقات العمل في النادي الرياضي  \
  </div> \
  <div className='row'> \
  ( الاحد : 8:00ص - 3:30م ( للبنات -  \
  </div> \
  <div className='row'> \
  ( الاحد : 4:00م - 9:30م ( للرجال -  \
    </div> \
    <div className='row'> \
    ( الاثنين : 8:00ص - 9:30م ( للرجال -  \
    </div> \
    <div className='row'> \
    ( الثلاثاء : 8:00ص - 9:30م ( للرجال -  \
    </div> \
    <div className='row'> \
    ( الأربعاء : 8:00ص - 3:30م ( للبنات -  \
    </div> \
    <div className='row'> \
    ( الأربعاء : 4:00م - 9:30م ( للرجال -  \
      </div> \
      <div className='row'> \
      ( الخميس: 8:00ص - 9:30م ( للرجال -  \
      </div> \
  <div className='row'> \
  متطلبات التسجيل بالنادي أن تكون طالب بجامعه الحرس فقط ويكون معك بادج الطالب و الهوية الوطنية  \
  </div>",
},
{
  title: "ماهي التخصصات الموجودة في الجامعة، بما في ذلك تخصصات كلية العلوم الطبية التطبيقية؟ واللي يبي تطبيقي متى وكيف يتخصص التخصص الذي يريده؟",
  content:
  "<div className='row'> \
  التخصصات الموجودة في الجامعة لطلاب فرع الرياض هي: 1-الطب البشري, 2-طب الأسنان, 3-الصيدلة الإكلينيكية, 4-المعلوماتية الصحية, 5-العلوم الطبية التطبيقية يندرج تحتها عدة تخصصات دقيقة \
  <div className='row'> \
  :تخصصات العلوم الطبية التطبيقية لطلاب فرع الرياض هي \
  </div> \
  <div className='row'> \
  علوم المختبرات الإكلينيكية-  \
  </div> \
  <div className='row'> \
  العلاج التنفسي-  \
  </div> \
  <div className='row'> \
  الخدمات الطبية الطارئة-  \
  </div> \
  <div className='row'> \
  العلاج الوظيفي-  \
  </div> \
  <div className='row'> \
  تقنية التخدير-  \
  </div> \
  <div className='row'> \
  علوم الأشعة-  \
  </div> \
  <div className='row'> \
  (تقنية القلب (القسطرة القلبية-  \
  </div> \
  <div className='row'> \
  بالنسبة للتخصيص  سيكون بعد السنة التحضيرية  الأولى ويعتمد على المعدل التراكمي للسنة التحضيرية الأولى فقط   \
  </div> \
  <div className='row'> \
  يتم فتح ترتيب الرغبات من خلال موقع SIS ويرتب الطالب الكليات حسب رغبته  \
  </div> \
  <div className='row'> \
  في حال كانت رغبة الطالب هي كلية العلوم الطبية التطبيقية، يتم القبول في الكلية نهاية السنة الأولى ويكون طالب علوم طبية تطبيقية، ولكن يجب أن ينتظر فصل دراسي آخر ليختار التخصص الدقيق  \
  </div> \
  <div className='row'> \
 (بعد الفصل الدراسي الثالث يتم فتح ترتيب رغبات التخصصات الدقيقة لطلاب العلوم الطبية  التطبيقية ويكون التنافس بناءً على المعدل التراكمي لأول ثلاثة فصول دراسية ( سمستر ١ و ٢ و ٣  \
  </div>  ",
},
{
  title: " كيف طبيعة الدوام بالسنة التحضيرية؟ ووش المقاهي والمطاعم الموجودة في الجامعة سواء للفطور أو الغداء؟",
  content:
  "<div className='row'> \
    بالنسبة للكلاسات و بشكل مبسط ، ٣ كلاسات بين كل كلاس و كلاس بريك ١٠ دقائق و من ثم بريك طويل لمدة ٢٠ دقيقة للفطور ، و بعدها كلاسين   \
  </div> \
  <div className='row'> \
  و بينها بريك ١٠ دقائق أو كلاس عرب أو سلم لمدة ساعتين \
 </div> \
  <div className='row'> \
  أما بالنسبة للمطاعم والكوفيهات, فيوجد محلين (كافتيريا) في الجامعة, واحد في المبنى الشمالي والآخر في المبنى الجنوبي, ويوجد كودو ودومينوز بجانب الحرم, وكذلك يوجد دانكن دونتس خلف برج الإدارة \
  </div>  ",
},
{
  title: "ماهي هي سياسة الحضور والغياب والحرمان في الجامعة بالتفصيل؟",
  content:
      " <div className='row'> \
      بالنسبة للحرمان، اذا غاب الطالب عن ٢٥٪؜ أو أكثر من عدد محاضرات المادة الواحدة في الترم يعتبر محرومًا في هذه المادة من دخول الاختبار النهائي \
      </div> \
      <div className='row'> \
      :وبحكم أن كل مادة لديها عدد ساعات فعلية مختلف فلكل مادة حسبة مختلفة لمعرفة حد الحرمان. على سبيل المثال \
     </div> \
     <div className='row'> \
    مادة العرب لها 16 محاضرة في الفصل لذلك يحرم الطالب في المادة عند 4 غيابات مما يعادل نسبة غياب %25- \
    </div> \
      <div className='row'> \
       مادة الفوكاب عليها 80 محاضرة في الفصل, لذلك يُحرم الطالب عند الغياب رقم 20 الذي يعادل 25% كذلك-\
      </div> \
      <div className='row'> \
      <hr/>   \
        </div> \
      <div className='row'> \
      بالنسبة لدرجات الحضور والغياب، فهنالك بعض المواد (مثل مواد اللغة الإنجليزية بشكل عام) درجات مخصصة للحضور والغياب تتراوح بين ٢% - ٥%. يبدأ الحسم ابتداءً من الغياب الثاني في الأغلب بهذه المواد  \
      </div> \
      <div className='row'> \
    %في المقابل بعض المواد الأخرى ليس لها درجات مخصصة للحضور والغياب (مثل العرب والسلم والمواد العلمية) ولكن حد الحرمان ما زال يطبق عن تجاوز نسبة الغياب 25   \
      </div> \
      <div className='row'> \
      <hr/>   \
        </div> \
      <div className='row'> \
      بالنسبة للتأخير، سياسة الجامعة التي يتبعونها المحاضرين هي: إذا تأخر طالب ٥ دقائق فما فوق يُسجل (متأخر) مع قدر التأخير، ويتم حسم الدرجات عن طريق تجميعها أو احتساب مدتها مقارنة بمدة المحاضرة من قبل موظفي شؤون الطلاب \
      </div> \
      <div className='row'> \
      أما في محاضرات العرب والسلم، تسجيل الغياب يتم من قبل موظفي شؤون الطلاب، وفي الغالب إذا تأخر الطالب أكثر من ٥ دقائق بعد موعد بدء المحاضرة للموظف الحق في اعتبار الطالب غائبًا  \
      </div> \
      <div className='row'> \
       إذا كان الغياب بعذر طبي أو حكومي، يتم تقديمه إلى قسم شؤون الطلاب بالكلية للتأكد من صلاحيته وشطب الغياب • \
      </div> ",
},
{
  title: "ما هي قوانين الاختبارات في السنة التحضيرية؟",
  content:
  " <div className='row'> \
  نظام الاختبارات في أغلب المواد عباره عن:  ميد أول + ميد ثاني + نهائي \
  </div> \
  <div className='row'> \
  (يوجد إستثناءات وسيتم ذكرها بتفصيل بالأسفل) \
  <div className='row'> \
  أما لمواد الانقلش: مجموعة من الكويزات مابين ٢-٦ (يتم تحديد عددها حسب المادة ومن قبل الأستاذ )+ ميد أول + ميد ثاني + نهائي \
  </div> \
  <div className='row'> \
  (وكذالك يوجد إستثناءات وسيتم ذكرها في الأسفل) \
  </div> \
  <div className='row'> \
  :ولكن قبل أن نفصل سنشرح بعض المصطلحات الجديدة    \
  </div> \
  <div className='row'> \
  الأول: (الميد) ونقصد فيه الاختبار الشهري  \
    </div> \
    <div className='row'> \
    الثاني: (الكويز أو الكويزات) ونقصد فيه الاختبارات القصيرة   \
      </div> \
      <div className='row'> \
      الثالث: (الكلاس) ونقصد فيه الفصل الدراسي ويتكون غالبًا من ٢٠-٢٤ طالب ويتم تدريس فيه مواد اللغة الإنجليزية   \
        </div> \
        <div className='row'> \
        الرابع: (القاعة) ونقصد فيها قاعة كبيرة يكون فيها تقريبًا ١٠٠ طالب ويتم تدريس فيها مادتين اللغة العربية والثقافية الإسلامية  \
          </div> \
          <div className='row'> \
          <hr/>   \
            </div> \
          <div className='row'> \
          :بيئة الاختبار وطريقة التصحيح   \
            </div> \
  <div className='row'> \
  أما في محاضرات العرب والسلم، تسجيل الغياب يتم من قبل موظفي شؤون الطلاب، وفي الغالب إذا تأخر الطالب أكثر من ٥ دقائق بعد موعد بدء المحاضرة للموظف الحق في اعتبار الطالب غائبًا  \
  </div> \
  <div className='row'> \
   إذا كان الغياب بعذر طبي أو حكومي، يتم تقديمه إلى قسم شؤون الطلاب بالكلية للتأكد من صلاحيته وشطب الغياب • \
  </div> ",
},
{
  title: "ما هي تفاصيل اختبارات السنة التحضيرية؟",
  content:
  "<div className='row'> \
  -:[الترم الأول] \
  <div className='row'> \
  المادة الأولى: العرب \
  </div> \
  <div className='row'> \
 نظام الإختبارات: ميد أول + نهائي \
  </div> \
  <div className='row'> \
   توزيع الدرجات: 10% على الواجب, 30% على الميد, 60% على النهائي \
  </div> \
  <div className='row'> \
نوع الأسئلة: جميعها اختيار من متعدد \
  </div> \
  <div className='row'> \
  الميد مكون من 40 سؤال ب 40 درجة, بمعنى على كل 1.3 سؤال نسبة واحدة  \
  </div> \
  <div className='row'> \
  الإختبار النهائي يزن 60% من النسبة الكلية  \
  </div> \
  <div className='row'> \
  النهائي مكون من 60 سؤال ب 60 درجة, بمعنى على كل سؤال نسبة واحدة ونوع الأسئلة اختيار من متعدد ايضا  \
  </div> \
  <div className='row'> \
  <hr/>   \
    </div> \
  <div className='row'> \
  المادة الثانية: ثقافة إسلامية  \
  </div> \
  <div className='row'> \
  نظام الإختبارات: ميد أول + نهائي \
   </div> \
   <div className='row'> \
    توزيع الدرجات: 10% على الواجب, 30% على الميد, 60% على النهائي \
   </div> \
   <div className='row'> \
 نوع الأسئلة: جميعها اختيار من متعدد \
   </div> \
   <div className='row'> \
   الميد مكون من 40 سؤال ب 40 درجة, بمعنى على كل 1.3 سؤال نسبة واحدة  \
   </div> \
   <div className='row'> \
   الإختبار النهائي يزن 60% من النسبة الكلية  \
   </div> \
   <div className='row'> \
   النهائي مكون من 60 سؤال ب 60 درجة, بمعنى على كل سؤال نسبة واحدة ونوع الأسئلة اختيار من متعدد ايضا  \
   </div> \
   <div className='row'> \
   <hr/>   \
     </div> \
  <div className='row'> \
  (English Reading and Vocabulary | ENGL 103) :المادة الثالثة  \
  </div> \
  <div className='row'> \
  نظام الإختبارات: 4-6 كويزات + ميد أول + ميد ثاني + نهائي \
   </div> \
   <div className='row'> \
    توزيع الدرجات:5% على الحضور, 10% على الكويزات والواجبات, 20% على الميد الأول, 25% على الميد الثاني, 40% على النهائي \
   </div> \
   <div className='row'> \
 طريقة الكويزات وأوقاتها وعددها يتم تحديده من قبل معلم المادة, وينطبق الشيء ذاته على الواجبات \
   </div> \
   <div className='row'> \
   الميد الأول 20% مكون من 55 سؤال ب 55 درجة, بمعنى على كل 2.75 سؤال نسبة واحدة, ونوع الأسئلة اختيار من متعدد  \
   </div> \
   <div className='row'> \
   الميد الثاني 25% مكون من 55 سؤال ب 55 درجة, بمعنى على كل 2.2 سؤال نسبة واحدة, ونوع الأسئلة اختيار من متعدد  \
   </div> \
   <div className='row'> \
   على الاختبار النهائي 40% مكون من 80 سؤال ب 80 درجة, بمعنى على كل سؤالين نسبة واحدة, ونوع الأسئلة اختيار من متعدد  \
   </div> \
   <div className='row'> \
   <hr/>   \
     </div> \
     <div className='row'> \
     (English Grammar | ENGL 102) :المادة الرابعة  \
     </div> \
     <div className='row'> \
     نظام الإختبارات: 5 كويزات + ميد أول + ميد ثاني + نهائي \
      </div> \
      <div className='row'> \
       توزيع الدرجات:5% على الحضور, 10% على الكويزات والواجبات, 20% على الميد الأول, 25% على الميد الثاني, 40% على النهائي \
      </div> \
      <div className='row'> \
      وحسب ما حصل سابقا كانت الكويزات تأتي موحده من الإدارة ونوعية الأسئلة فيه منها المقالي وفيه منها الاختيار من متعدد \
            </div> \
      <div className='row'> \
      الميد الأول 20% مكون من 80 سؤال ب 80 درجة, بمعنى على كل 4 اسئلة نسبة واحدة, الأسئلة تنقسم الى 58 سؤال اختيار من متعدد + 22 سؤال مقالي او كتابي  \
      </div> \
      <div className='row'> \
     الميد الثاني 25% مكون من 80 سؤال ب 80 درجة, بمعنى على كل 3.2 سؤال نسبة واحدة, الأسئلة تنقسم الى 50 سؤال اختيار من متعدد + 30 سؤال ملئ الفراغات  \
      </div> \
      <div className='row'> \
      على الاختبار النهائي 40% مكون من 95 سؤال ب 95 درجة, بمعنى على كل 2.3 سؤال نسبة واحدة, الأسئلة تنقسم الى 80 سؤال اختيار من متعدد + 15 سؤال مقالي  \
      </div> \
      <div className='row'> \
      <hr/>   \
        </div> \
        <div className='row'> \
        (English Communication Skills | ENGL 101) :المادة الخامسة  \
        </div> \
        <div className='row'> \
        :نبذة بسيطة: هذه المادة عبارة عن مادتين مدمجة وهي \
         </div> \
         <div className='row'> \
          speaking and listening \
         </div> \
         <div className='row'> \
         writing \
        </div> \
        <div className='row'> \
        وكل مادة لها مدرسها وكتبها الخاصة ولكن في النهاية تجمع الدرجات كلها مع بعض وتكون من ١٠٠٪؜ \
       </div> \
         <div className='row'> \
          توزيع الدرجات لمادة الكتابة:2% على الحضور, 8% على الكويزات , 15% على الثلاث قطع, 10% على النهائي الكتابي \
         </div> \
         <div className='row'> \
         عدد الكويزات اقل شيء إثنان وقد يختلف من معلم الى آخر \
               </div> \
        <div className='row'> \
        بالنسبة لل15% الخاصة بالقطع, فالقطع عبارة عن كتابة قطعة على عدة ايام, 3 مرات بالفصل الدراسي, القطعة الأولى 4%, الثانية 5% الثالثة 6% من المجموع الكلي \
        </div> \
               <div className='row'> \
         النهائي الكتابي هو عبارة عن كتابة القطعة كاملة في 3 ساعات وبدون مساعدة المعلم \
         </div> \
         <div className='row'> \
         توزيع الدرجات لمادة التحدث والاستماع:2% على الحضور, 8% على الكويزات , 5% على تقديم عرضان بالفصل, 15% على الميد, 5% على المقابلة الشخصية, 25% على النهائي \
         </div> \
         <div className='row'> \
         بالنسبة للعروض, فالأول عليه 2% والثاني 3%, ستقدم باستخدام الباوربوينت في الفصل وستقيم من المعلم  \
         </div> \
         <div className='row'> \
         بالنسبة للميد, 60 سؤال اختيار من متعدد وعليه 60 درجة بمعنى على كل 4 اسئلة نسبة واحدة  \
         </div> \
         <div className='row'> \
بالنسبة للمقابة الشخصية, ستعقد فيه نهاية الفصل باللغة الانجليزية من قبل معلمين او ثلاثة, بالطبع ليس لها اي علاقة بمقابلة القبول\
         </div> \
         <div className='row'> \
         بالنسبة للاختبار النهائي, سيشمل اسئلة من كلتا المادتين, 90 سؤال ب 90 درجة بمعنى كل 3.6 سؤال بنسبة واحدة, الاسئلة اختيار من متعدد\
                      </div>  ",
},

{
  title: "ما الفرق بين الساعات الأكاديمية والساعات الفعلية وما عددها؟",
  content:
  "<div className='row'> \
  <span className='d-block'>الساعات الأكاديمية: هي الساعات التي تحتسب في معدل الطالب وهي تعبّر عن مدى وزن المادة، بمعنى كل ما زادت الساعات الأكاديمية للمادة زاد تأثير المادة على المعدل بشكل عام</span> \
  </div> \
  <div className='row'> \
  عدد الساعات الأكاديمية هي ١٨ ساعة للترم الأول والثاني \
  </div> \
  <div className='row'> \
  <hr/>   \
    </div> \
    <div className='row'> \
    بينما الساعات الفعلية: هي عبارة عن عدد الساعات اللي يدرسها الطالب لكل مادة في الجامعة على أرض الواقع خلال الأسبوع الدراسي \
    </div> \
    <div className='row'> \
    عدد الساعات الفعلية للترم الأول 23 ساعة اما الترم الثاني 24 ساعة \
    </div> \
    <div className='row'> \
    :و في بعض الحالات تختلف الساعات الأكاديمية عن الفعلية للمادة, مثل \
    </div> \
  <div className='row'> \
  مادة القرامر في الترم الثاني ساعاتها الأكاديمية= ساعتين، أما بالنسبة لساعاتها الفعلية= ٤ ساعات أسبوعياً\
  </div> ",
},
{
  title: "كيف استطيع الحصول على تعريف بالطالب وما هي الخطوات؟",
  content:
  "<div className='row'> \
  جرت العادة أن يكون الحصول على ورقة تعريف بالطالب من خلال التوجه لمكتب شؤون الطلاب وطلبها وطباعتها من هناك \
  </div> \
  <div className='row'> \
  لكن حاليا يمكن طلبا بشكل إلكتروني وذلك عبر التوجه <a rel='noopener noreferrer' href='https://cas.ksau-hs.edu.sa/cas/login?service=https%3A%2F%2Fcom.ksau-hs.edu.sa%2Findex.php%2F22-com%2Feservices%3Fserver%3D1'> لهذا الموقع</a> \
  </div> \
  <div className='row'> \
   وتسجيل الدخول فيه واتباع الخطوات الموجودة <a rel='noopener noreferrer' href='https://com.ksau-hs.edu.sa/sis/images/materials/stumaneservices.pdf'> بهذا الرابط</a>  \
  </div> \
  <div className='row'> \
  يرجى الانتباه ان الخطوات الموجودة تم إعدادها في عام 2016 وواجهة الموقع مرّت على العديد من التحديثات؛ لذا قد تواجه بعض الاختلافات \
  </div> \
  <div className='row'> \
  <hr/>   \
    </div> \
    <div className='row'> \
    :ويوجد طريقة اخرى أكثر فعالية وأسرع من المذكورة مسبقاً، وذلك من خلال مراسلة عمادة شؤون الطلاب، عبر احدى هذه الوسائل \
    </div> \
    <div className='row'> \
    الايميل  \
    </div> \
    <div className='row'> \
    StudentAffairs-COSHP@ksau-hs.edu.sa \
    </div> \
    <div className='row'> \
    تويتر  \
    </div> \
    <div className='row'> \
     <a rel='noopener noreferrer' href='https://twitter.com/COSHPSA'> https://twitter.com/COSHPSA</a>\
    </div>  ",
},
    ],
};


export class FAQ extends Component {

  render() {
    return (
      <div className="container" style={{fontSize: "1.3em"}}>
        <h1 className="text-center text-red mt-4 ">أسئلة شائعة</h1>
        
      <Faq data={data} styles={styles} config={config}  style={{textAlign: 'right', fontSize: "1.3em"}}/>

        </div>
    );
  }
}

export default FAQ;
